<?php
return array(
	//'配置项'=>'配置值'
	 /* 数据库设置 */
    'DB_TYPE'               =>  'Mysql',     // 数据库类型
    'DB_HOST'               =>  'localhost', // 服务器地址
    'DB_NAME'               =>  'hunlian',          // 数据库名
    'DB_USER'               =>  'hunlian',      // 用户名
    'DB_PWD'                =>  'hunlian123',          // 密码
    'DB_PORT'               =>  '',        // 端口
	'DB_PREFIX'             =>  'yyw_',    // 数据库表前缀
    //'DB_DSN'             	=>  'mysql:host=localhost;dbname=yyw;charset=utf8',    
	
	//'SHOW_PAGE_TRACE' 	=> true,	// 显示页面Trace信息
	
	'MODULE_ALLOW_LIST'	=> array('Home','Admin'),	//设置当前允许访问的模块
	'DEFAULT_MODULE'	=> 'Home',			//默认模块
	'TMPL_PARSE_STRING' =>  array( // 地址替换,用_UPLOAD_目录 代替 根目录下的Upload目录
    '__UPLOAD__'        =>  '/Uploads',
     ),
	 //自定义用户配置
	 'USER_CONFIG'		=>array(
			//默认头像
			'AVATAR'		=> array(1=>'male.gif',2=>'female.gif'), 
			//用户小图标
			'ICON'			=> array(1=>'f2fde8e7d8aa2a10.gif',2=>'87197a0d51022068.gif'),	
			//婚姻状况
			'MARRY'			=> array(1=>'单身',2=>'已婚',3=>'离异',4=>'丧偶'),
			//血型
			'BLOODTYPE'     => array(0=>'未填写',1=>"A型",2=>"B型",3=>"O型",4=>"AB型",5=>"其他"),
			//生肖
			'ZODIAC'      	=> array(0=>'猴',1=>'鸡',2=>'狗',3=>'猪',4=>'鼠',5=>'牛',6=>'虎',7=>'兔',8=>'龙',9=>'蛇',10=>'马',11=>'羊'),
			//个性
			'PERSONALITY'   => array(1=>'浪漫迷人',2=>'成熟稳重',3=>'风趣幽默',4=>'乐天达观',5=>'活泼可爱',6=>'忠厚老实',7=>'淳朴害羞',8=>'温柔体贴',9=>'多愁善感',10=>'新潮时尚',11=>'热辣动感',12=>'豪放不羁'),
			//有无小孩
			'CHILD'			=> array(0=>'未填写',1=>"无小孩",2=>"有,和我住一起",3=>"有,有时和我住一起",4=>"有,不和我住一起"),
			//是否有房
			'HOUSE'			=> array(0=>'未填写',1=>"暂未购房",2=>"需要时置房",3=>"已购住房",4=>"与人合租",5=>'独自租房',6=>'与父母同住',7=>'住亲朋家',8=>'住单位房'),
			//学历
			'EDU'    		=> array(1=>'中专以下学历',2=>'中专',3=>'大专',4=>'本科',5=>'硕士',6=>'博士',7=>'博士后'),
			//薪水
			'SALARY'		=> array(1=>'2000以下',2=>'2000-5000元',3=>'5000-10000元',4=>'10000-20000元',5=>'20000元以上',6=>'保密'),
			//公司类型
			'COMPANY'		=> array(0=>'未填写',1=>'政府机关',2=>'事业单位',3=>'外企企业',4=>'世界500强',5=>'上市公司',6=>'国有企业',7=>'私有企业',8=>'自有公司'),
			//收入描述
			'INCOME'		=> array(0=>'未填写',1=>'福利优越',2=>'奖金丰厚',3=>'事业稳定上升',4=>'事业刚起步',5=>'投资高回报'),
			//工作状况
			'WORK'			=> array(0=>'未填写',1=>'轻松稳定',2=>'朝九晚五',3=>'偶尔加班',4=>'经常加班',5=>'偶尔出差',6=>'经常出差',7=>'经常有应酬',8=>'工作时间自由'),
			//专业类型
			'MAJOR'			=> array(0=>'未填写',1=>'计算机类',2=>'电子信息类',3=>'中文类',4=>'外文类',5=>'经济学类',6=>'金融学类',7=>'管理类',8=>'市场营销类',9=>'法学类',10=>'教育类',
									11=>'社会学类',12=>'历史类',13=>'哲学类',14=>'艺术类',15=>'图书馆类',16=>'情报档案类',17=>'政治类',18=>'数学类',19=>'统计类',20=>'物理类',
									21=>'化学类',22=>'生物类',23=>'食品类',24=>'医学类',25=>'环境类',26=>'地理类',27=>'建筑类',28=>'测绘类',29=>'电气类',30=>'机械类',31=>'其他类'),
			//家中排行
			'RANKING'		=> array(0=>'未填写',1=>'独生子女',2=>'老大',3=>'老二',4=>'老三',5=>'老四',6=>'老五及更小',7=>'老幺'),
			//主要消费
			'MAINCONSUME'	=> array(0=>'未填写',1=>'美食',2=>'服装',3=>'娱乐',4=>'出行',5=>'交友',6=>'文化',7=>'教育',8=>'其他'),
			//有无宗教信仰
			'BELIEF'		=> array(0=>'未填写',1=>'无宗教信仰',2=>'大乘佛教显宗',3=>'大乘佛教密宗',4=>'小乘佛教',5=>'道教',6=>'儒教',7=>'基督教天主教派',8=>'基督教东正教派',9=>'基督教新教派',10=>'犹太教',
									11=>'伊斯兰教什叶派',12=>'伊斯兰教逊尼派',13=>'印度教',14=>'神道教',15=>'萨满教',16=>'其他宗教信仰'),
			//外貌自评			
			'ZJAPPEARANCE'  => array(0=>'未填写',1=>'文质彬彬型',2=>'西部牛仔型',3=>'阳光帅气型',4=>'风度翩翩型',5=>'成熟魅力型',6=>'儒教',7=>'健壮高大型',8=>'朴实无华型',9=>'内敛酷男型',10=>'秀外慧中',
									11=>'眉清目秀',12=>'明眸善睐',13=>'娇小依人',14=>'青春活泼',15=>'成熟魅力',16=>'雍容华贵',17=>'淡雅如菊'),
			//魅力部位
			'ATTR'          => array(0=>'未填写',1=>'笑容',2=>'眉毛',3=>'眼睛',4=>'头发',5=>'鼻梁',6=>'嘴唇',7=>'牙齿',8=>'颈部',9=>'耳朵',10=>'手',
									11=>'胳膊',12=>'胸部',13=>'腰部',14=>'臀部',15=>'腿',16=>'脚',17=>'没有太特别的'),
			//发型
			'HAIRCUT'       => array(0=>'未填写',1=>'顺直长发',2=>'卷曲长发',3=>'中等长度',4=>'短发',5=>'很短',6=>'光头',7=>'其他'),
			//发色		
			'HAIRCOLOR'     => array(0=>'未填写',1=>'黑色',2=>'金色',3=>'褐色',4=>'栗色',5=>'灰色',6=>'红色',7=>'白色',8=>'挑染',9=>'光头',10=>'其它'),
			//脸型
			'FACE'          => array(0=>'未填写',1=>'圆脸型',2=>'方脸型',3=>'长脸型',4=>'瓜子脸型',5=>'鸭蛋脸型',6=>'国字脸型',7=>'三角脸型',8=>'菱形脸型'),
			//体型
			'SIZE'          => array(0=>'未填写',1=>'瘦',2=>'较瘦',3=>'匀称',4=>'苗条',5=>'高挑',6=>'丰满',7=>'健壮',8=>'魁梧',9=>'胖',10=>'较胖'),
			//工作
			'JOB'			=> array(0=>'未填写',1=>'在校学生',2=>'计算机/互联网/IT',3=>'电子/半导体/仪表仪器',4=>'通信技术',5=>'销售',6=>'市场拓展',7=>'公关/商务',8=>'采购/贸易',9=>'客户服务/技术支持',10=>'人力资源/行政管理',
									11=>'高级管理',12=>'生产/加工/制造',13=>'质控/安检',14=>'工程机械',15=>'技工',16=>'会计/审计/统计',17=>'金融/证券/投资',18=>'房地产/装修/物业',19=>'仓储/物流',20=>'交通/运输',
									21=>'普通劳动力/家政服务',22=>'普通服务行业',23=>'航空服务行业',24=>'教育/培训',25=>'咨询/顾问',26=>'学术/科研',27=>'法律',28=>'设计/创意',29=>'文学/传媒/影视',30=>'餐饮/旅游',
									31=>'化工',32=>'能源/地质勘查',33=>'医疗/护理',34=>'保健/美容',35=>'生物/制药/医疗器械',36=>'体育工作者',37=>'翻译',38=>'公务员/国家干部',39=>'私营业主',40=>'农/林/牧/渔业',
									41=>'警察/其他',42=>'自由职业者',43=>'其他'),
	 		//语言
			'LANG'			=> array(0=>'未填写',1=>'中文(普通话)',2=>'中文(广东话)',3=>'英语',4=>'法语',5=>'日语',6=>'韩语',7=>'德语',8=>'意大利语',9=>'俄语',10=>'芬兰语',
									11=>'荷兰语',12=>'葡萄牙语',13=>'西班牙语',14=>'越南语',15=>'阿拉伯语',16=>'泰国语',17=>'印度尼西亚语',18=>'印度语',19=>'丹麦语',20=>'希腊语',
									21=>'伊朗语',22=>'匈牙利语',23=>'土耳其语',24=>'挪威语',25=>'捷克语',26=>'波兰语',27=>'瑞典语',28=>'缅甸语',29=>'罗马尼亚语'),
						
			'HEJIU'         => array(0=>"未透露",1=>'不喝',2=>'社交需要时喝',3=>'有兴致时喝',4=>'每天都离不开酒'),
			
			'CHOUYAN'       => array(0=>"未透露",1=>'吸，很反感吸烟',2=>'不吸，但不反感',3=>'社交时偶尔吸',4=>'每周吸几次',5=>'每天都吸',6=>'有烟瘾'),
			
			'PAIHANG'       => array(0=>"未透露",1=>"独生子女",2=>"老大",3=>"老二",4=>"老三",5=>"老四",6=>"老五及更小",7=>"老幺"),
			
			'XIAOFEI'       => array(0=>"未透露",1=>"美食",2=>"服装",3=>"娱乐",4=>"出行",5=>"交友",6=>"文化",7=>"教育",8=>"其他"),
			
			'ZONGJIAO'      => array(0=>"未透露",1=>"无宗教信仰",2=>"大乘佛教显宗",3=>"大乘佛教密宗",4=>"小乘佛教",5=>"道教",6=>"儒教",7=>"基督教天主教派",8=>"基督教东正教派",
					        9=>"基督教新教派",10=>"犹太教",11=>"伊斯兰教什叶派",12=>"伊斯兰教逊尼派",13=>"印度教",14=>"神道教",15=>"萨满教",16=>"其他宗教信仰"),
			
			'DOUANLIAN'     => array(0=>"未透露",1=>"每天锻炼",2=>"每周至少一次",3=>"每月几次",4=>"没时间锻炼",5=>"集中时间锻炼",6=>"不喜欢锻炼"),
			
			'ZUOXI' 		=> array(0=>"未透露",1=>"早睡早起很规律",2=>"经常夜猫子",3=>"总是早起鸟",4=>"偶尔懒散一下",5=>"没有规律"),
	
			'HAIZI'         => array(0=>"未透露",1=>"愿意",2=>"不愿意",3=>"视情况而定"),
			
		
			'LANGMAN'       => array(0=>"未透露",1=>"经常",2=>"偶尔",3=>"视情况而定",4=>"从不",5=>"不喜欢"),
			
			'JINENG'        => array(0=>"未透露",1=>"现实个人目标",2=>"维护朋友圈关系",3=>"装修房屋",4=>"志愿者/义工",5=>"热衷电脑",6=>"保持生活条律",7=>"理财",8=>"在家款待朋友",
					        9=>"抚养或照顾孩子",10=>"制造浪漫",11=>"社交活动",12=>"谈生意",13=>"保持健康",14=>"解决冲突",15=>"博闻强识",16=>"对自我长期规划",17=>'在简单中寻求快乐与满足',18=>'文化和艺术',19=>'结交新朋友',20=>'烹饪',21=>'赚钱养家',22=>'保养、修理汽车',23=>'做别人的好朋友和好同事',24=>'其他'),
			
			'SPORT'         => array(0=>"未透露",1=>"足球",2=>"篮球",3=>"排球",4=>"网球",5=>"羽毛球",6=>"乒乓球",7=>"壁球",8=>"保龄球",
					        9=>"手球",10=>"橄榄球",11=>"棒球",12=>"高尔夫",13=>"健身",14=>"跑步",15=>"自行车",16=>"摩托车",17=>'汽车',18=>'舞蹈',19=>'体操',20=>'跆拳道',21=>'柔道',22=>'空手道',23=>'游泳',24=>'潜水',25=>'水上运动',26=>'航海',27=>'滑雪/滑冰',28=>'拳击',29=>'钓鱼',30=>'瑜伽',31=>'武术',32=>'其它',33=>'不喜欢运动'),
			
			'FOOD'          => array(0=>"未透露",1=>"中国菜",2=>"印度菜",3=>"泰国菜",4=>"法国菜",5=>"意大利菜",6=>"俄罗斯菜",7=>"日本菜",8=>"烧烤",
					        9=>"健康食品",10=>"素食",11=>"快餐",12=>"巧克力和甜品",13=>"其他",14=>"无特别爱好"),
			
			'BOOK'    		=> array(0=>"未透露",1=>"校园青春",2=>"文学",3=>"艺术与摄影",4=>"励志与成功",5=>"动漫与幽默",6=>"政治与军事",7=>"哲学与宗教",8=>"历史传记",
							9=>"运动健身",10=>"健康与养生",11=>"烹饪与饮食",12=>"旅游",13=>"投资理财",14=>"婚恋与家庭",15=>"期刊杂志",16=>"娱乐时尚",17=>'人文社科',18=>'自然科学',19=>'收藏与鉴赏',20=>'其他',21=>'什么都看'),
			
			'FILM' 			=> array(0=>"未透露",1=>"爱情",2=>"喜剧",3=>"动作冒险",4=>"古装武侠",5=>"科幻魔幻",6=>"悬疑推理",7=>"惊悚恐怖",8=>"动画",
							9=>"战争",10=>"音乐歌舞",11=>"纪录片",12=>"剧情",13=>"西部",14=>"历史传记",15=>"其他",16=>"什么都看"),
			
			'INTERSET'		=> array(0=>"未透露",1=>"网络",2=>"汽车",3=>"动物",4=>"摄影",5=>"影视",6=>"音乐",7=>"写作",8=>"购物",
							9=>"手工艺",10=>"园艺",11=>"舞蹈",12=>"展览",13=>"烹饪",14=>"读书",15=>"绘画",16=>"计算机",17=>'体育运动',18=>'旅游',19=>'电子游戏',20=>'其他'),
			
			'LVYOU' 		=> array(0=>"未透露",1=>"惬意海岛",2=>"名山古刹",3=>"繁华都市",4=>"风情名城",5=>"广袤森林",6=>"高原雪域",7=>"秀美山水",8=>"历史遗迹",
							9=>"江河大川",10=>"峻秀峡谷",11=>"小桥流水人家",12=>"其他选择",13=>"还没想好"),
			
			'GUANZHU' 		=> array(0=>"未透露",1=>"政治事件",2=>"娱乐八卦",3=>"体育赛事",4=>"理财投资",5=>"相声曲艺",6=>"海选活动",7=>"畅销书",8=>"影视热片",9=>"休闲生活",10=>"行业发展",11=>"其他",12=>"暂无"),
			
			'YULE' 			=> array(0=>"未透露",1=>"饭店",2=>"商场",3=>"剧院",4=>"酒吧",5=>"电影院",6=>"音乐会",7=>"迪斯科",8=>"网吧",
							9=>"温泉",10=>"图书馆/书店",11=>"咖啡厅",12=>"游乐场",13=>"卡拉OK",14=>"体育馆",15=>"逛街",16=>"在自己或朋友家里",17=>'其他',18=>'不想说'),
	
	),
);